app/controllers/school_classes_controller.rb

    def update
        @school_class=SchoolClass.find(params[:id])
        @school_class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 1872], ["updated_at", "2020-06-28 03:32:59.712410"], ["id", 1]]