app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Michael"], ["last_name", "Jester"], ["created_at", "2020-06-25 04:25:54.095688"], ["updated_at", "2020-06-25 04:25:54.095688"]]
---
    def create
        @student = Student.create(student_params(:first_name, :last_name))

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "steve"], ["last_name", "p["], ["updated_at", "2020-06-28 03:13:24.863259"], ["id", 3]]
---
    def update
        @student = find_student
        @student.update(student_params(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def find_student
        @student = Student.find(params[:id])